constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    XMin
    {
        type            patch;
        nFaces          384;
        startFace       104699;
    }
    XMax
    {
        type            patch;
        nFaces          336;
        startFace       105083;
    }
    YMin
    {
        type            patch;
        nFaces          159;
        startFace       105419;
    }
    YMax
    {
        type            patch;
        nFaces          132;
        startFace       105578;
    }
    ZMin
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1240;
        startFace       105710;
    }
    ZMax
    {
        type            patch;
        nFaces          187;
        startFace       106950;
    }
    solarpanel_body_left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2187;
        startFace       107137;
    }
    solarpanel_body_right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2169;
        startFace       109324;
    }
    solarpanel_body_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2652;
        startFace       111493;
    }
    solarpanel_body_back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          907;
        startFace       114145;
    }
    ref_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1377;
        startFace       115052;
    }
)

// ************************************************************************* //
