0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(solarpanel.*|ref_wall|ZMin)"
    {
        type            fixedValue;
        value           uniform (0.0 0 0);
    }
    
    YMin
    {
        type            fixedValue;
        value           uniform (0.0 0.1 0);
    }
    
    XMin
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    "(ZMax|XMax|YMax)"
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
}


// ************************************************************************* //
